export default {
  'get|/visit/page': option => {
    return {
      code: 200,
      msg: 'ok',
      data: {
        page: 1,
        size: 10,
        totalPage: 1000,
        list: [{
          id: 1,
          date: '2022-2-22',
          comId: 1,
          comName: 'xxxxx社区',
          desc: '我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述'
        }, {
          id: 1,
          date: '2022-2-22',
          comId: 1,
          comName: 'xxxxx社区',
          desc: '我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述'
        }, {
          id: 1,
          date: '2022-2-22',
          comId: 1,
          comName: 'xxxxx社区',
          desc: '我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述'
        }, {
          id: 1,
          date: '2022-2-22',
          comId: 1,
          comName: 'xxxxx社区',
          desc: '我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述'
        }, {
          id: 1,
          date: '2022-2-22',
          comId: 1,
          comName: 'xxxxx社区',
          desc: '我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述'
        }, {
          id: 1,
          date: '2022-2-22',
          comId: 1,
          comName: 'xxxxx社区',
          desc: '我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述'
        }, {
          id: 1,
          date: '2022-2-22',
          comId: 1,
          comName: 'xxxxx社区',
          desc: '我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述'
        }, {
          id: 1,
          date: '2022-2-22',
          comId: 1,
          comName: 'xxxxx社区',
          desc: '我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述'
        }, {
          id: 1,
          date: '2022-2-22',
          comId: 1,
          comName: 'xxxxx社区',
          desc: '我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述'
        }, {
          id: 1,
          date: '2022-2-22',
          comId: 1,
          comName: 'xxxxx社区',
          desc: '我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述'
        }, {
          id: 1,
          date: '2022-2-22',
          comId: 1,
          comName: 'xxxxx社区',
          desc: '我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述我是描述'
        }
        ]
      }
    }
  }
}
